//
// Created by Dongliu_Wen on 2022/10/18.
//
/*
 * 【问题描述】

输入整数n（1<=n<=10000），计算公式1+1/(1+2)+...1/(1+2+...+n)的值。

【输入形式】

从控制台输入整数n（1<=n<=10000）。

【输出形式】

控制台输出公式结果：小数点后保留4位。

【样例输入】

4
【样例输出】

1.6000
【样例说明】

输入n为4，求得公式1 + 1/(1+2) + 1/(1+2+3)+ 1/(1+2+3+4)的值为1.6000，小数点后保留4位。

注意：为保证数据的准确性和一致性，请使用double数据类型保存计算结果。
 */
#include <stdio.h>

int main(void)
{
    double a;
    double b=0;
    scanf("%lf",&a);
    for(double i = 1,c=0;i<=a;++i)
    {
        c+=i;
        b+=(1/c);
    }

    printf("%.4f",b);

    return 0;
}